import request from "request";
import fs from "fs-extra";
import path from "path";

// محتوى القواعد
const ZiaReinRules = `●═══════❍════════●
الــصَـداقَــة هِــي أنْ تَــذهَـبْ وَتَــعُـود وَتَــجــد لِــ نَــفــسَـكْ “ مَــكـانـاً ” بِـيـنَـهُـمْ
قواعد وشروط الجروب♥
1- احترام آراء الآخرين وعدم التلفظ بألفاظ تخدش الحياء
2- الحفاظ على القيم والعادات والتقاليد
3- الحفاظ على تعاليم الدين الاسلامي
4- المرجو التعامل مع المنشورات الجديه بكل حزم وجد والمنشورات الاخرى يتعامل فيها كل عضو بمايريد مع العلم ان التعليق يعبر عن شخصيتك
5 - عدم وضع صور إباحية ومثيرة جدا وذلك تفاديا لإثارة المشاكل من قبل بعض الأعضاء
6- عدم إزعاج البنات بطلبات الأضافة داخل الجروب أو الرسائل غير اللائقة.....يتم تنبيه العضو لمره واحده واذا لم يستجب العضو المعني يحذف على الفور
7- عدم نشر اي صفحه في هذا للجروب
تنبيه العضو لمره واحده واذا لم يستجب العضو المعني يحذف على الفور
8- التشهير والتشويه لعضو ما او إنسان ما ؟ داخل الجروب يمنع منعا باتا ويتحمل صاحب الموضوع الجزاء وهوا الحذف النهائي
9- يرجى عدم نشر المنشورات السياسية لكافة الدول العربية و اى عضو سينشر اى منشور سياسى سيتم تحذيره مرة واحدة و بعد ذلك سيتم طرد العضو
10- أرجو الابلاغ فوراً عن أي شيء مخالف داخل الجروب
11- ممنوع نشر الصور الشخصيه على الجروب او كتابه ارقام الهواتف الخاصه بكم
12- السياسه ممنوعه منعا باتا ..................... وبكرر منمنوع السياسه منعا باتا
13- اى شاب يحاول الدخول باسم بنت مصيره #الطرد
.......اي شخص يسيء للجروب سيتم حظره
...... ? فأتمنى أن نبقى اخوة ? .....
لن نجبر أحداً على دخول المجموعة ولا على البقاء فيها !!!
ولكني ألتمس من الموجودين فيها إحترام قوانينها.
المجموعه منكم ولكم وانتم من يتصرف بمجريات الامور وكلنا تقة فيكم
ارجوا من الجميع الالتزام ولكم خالص الشكر والتقدير على التعاون
●═══════❍════════●`;

// قائمة روابط الصور
const imageUrls = [
"https://i.imgur.com/huumLca.jpg",
"https://i.imgur.com/EcryTGh.jpg",
"https://i.imgur.com/tu12HrQ.jpg",
"https://i.imgur.com/Vx25FHG.jpg",
"https://i.imgur.com/NcbC8Pn.jpg",
];

const execute = async ({ api, event }) => {
  // اختيار صورة عشوائية من القائمة
  const randomImageUrl = imageUrls[Math.floor(Math.random() * imageUrls.length)];
  const imagePath = path.join(process.cwd(), "cache", "ZiaRein.jpg");

  // تحميل الصورة المختارة وحفظها مؤقتًا
  return request(encodeURI(randomImageUrl))
    .pipe(fs.createWriteStream(imagePath))
    .on("close", () => {
      // إرسال القواعد مع الصورة
      api.sendMessage(
        {
          body: ZiaReinRules,
          attachment: fs.createReadStream(imagePath),
        },
        event.threadID,
        (err) => {
          if (!err) {
            fs.unlinkSync(imagePath); // حذف الصورة بعد الإرسال
          }
        }
      );
    });
};

export default {
  name: "قواعد",
  author: "Hussein Yacoubi",
  role: "member",
  description: "Sends group rules with a random image.",
  execute,
};
